[
  {
    "id": "contractor",
    "dateString": "Feb 2025 - Present",
    "title": "Consultant",
    "location": "San Francisco, CA",
    "companyName": "Rhyneer Consulting LLC",
    "imgSrc": "https://d3fcqgp9jd8oav.cloudfront.net/branding/RhyneerConsulting.png",
    "stats": [
      { "name": "System Architecture", "level": 70 },
      { "name": "AI Integration", "level": 80 },
      { "name": "Start-uppy stuff :)", "level": 90 }
    ],
    "description": "I provide consulting services to a variety of clients.",
    "bullets": [
      "Migrated entirety of odapt.ai from raw html/js to React.",
      "Built humanitysvoice.net, a crowd sourced social media posting tool, where users can vote on words to be added to a growing social media post that then gets posted each day."
    ]
  },
  {
    "id": "compoze",
    "dateString": "Jan 2025 - Feb 2025",
    "title": "AI Engineer",
    "location": "Minneapolis, MN",
    "companyName": "CompozeLabs",
    "imgSrc": "/assets/compoze.png",
    "stats": [
      { "name": "AI Integration", "level": 75 },
      { "name": "NextJS", "level": 80 },
      { "name": "AWS", "level": 60 },
      { "name": "AI Framework Design", "level": 70 }
    ],
    "description": "I solo-stood up a voice-interactive sales-coaching tool. Using a novel architecture that uses multiple LLMs to analyze a conversation in real time, I was able to build a tool where a user can practice real-time sales pitches against a voice AI modeled on a real person. The AI can ask questions, respond to the user, and provide feedback on the user's performance.",
    "bullets": [
      "POV was estimated to take 4-6 weeks, I did it in one.",
      "Designed and implemented a novel 'thinker' architecture. Integrates multiple LLMs to analyze a conversation in real time and gave feedback to the voice model, enabling higher performance.",
      "Worked closely with client to refine product, manage project scope and priorities and rapidly iterate on the product to meet client needs.",
      "Had the term 'silas velocity' coined by colleagues, referring to the speed at which I develop quality code."
    ]
  },
  {
    "id": "concord",
    "dateString": "Aug 2022 - Dec 2024",
    "title": "Consultant",
    "location": "Minneapolis, MN",
    "companyName": "Concord USA",
    "imgSrc": "/assets/concord.jpeg",
    "stats": [
      { "name": "React", "level": 85 },
      { "name": "TypeScript", "level": 90 },
      { "name": "SQL Server", "level": 60 },
      { "name": ".NET", "level": 70 }
    ],
    "description": "I did technical consulting. This meant diagnosing and solving problems for a client before they knew they had them. I helped refine product needs, coordinated resources across teams to solve solutions quickly, and architected new solutions. One part professional communicator, one part software engineer, and a little bit of everything else.",
    "bullets": [
      "Fullstack developer for an internal web app used company-wide. Produced 2x the commits and 5x the code compared to any other developer on the project. I work fast.",
      "Optimized page loading by seconds. Refactored, optimized, and modernized massive quantities of enterprise code base, reducing technical debt.",
      "Architected and coordinated development of features across multiple applications and 3rd-party APIs, such as for a messaging service to provide real-time updates to users.",
      "Identified and fixed longstanding authentication and authorization issues across the application, resolving critical security vulnerabilities in production code."
    ]
  },
  {
    "id": "mystica",
    "dateString": "Aug 2024 - Dec 2024",
    "title": "Lead Developer at Mystica",
    "location": "Minneapolis, MN",
    "companyName": "Tricky Djinn LLC",
    "imgSrc": "https://d3fcqgp9jd8oav.cloudfront.net/misc/Mystica M.png",
    "stats": [
      { "name": "ReactNative", "level": 90 },
      { "name": "PostgreSQL", "level": 75 },
      { "name": "Redis", "level": 70 },
      { "name": "Spring", "level": 90 }
    ],
    "description": "I co-founded a startup thats building a geo-RPG, powered by AI. I am acting as the CTO and lead developer on our team of five. Learn more at mystica.cloud. We're building a new kind of game that uses AI to run fantasy text adventures based on your location.",
    "readMoreText": "Mystica is an AI-powered, text-based adventure game. In it, you wander the real world, going to real locations, and fight fantasy creatures. However, unlike other games that blend game and reality, we don't use AR—instead, we focus on the combat experience itself, aiming to replicate text adventures and tabletop roleplaying games. In Mystica, you are met with a situation and are tasked with overcoming whatever challenge it presents by describing the choices you make. The AI responds, and that's how the game plays out.\n\nFrom a technical standpoint, this is quite challenging. Despite the 'magic' of AI, we're asking a lot of it—we're asking it to act as a game engine. At Tricky Djinn, I was tasked with designing and implementing the fundamental game loop interaction between player and AI. Rather than building our own AI from scratch, I decided to use an LLM API. However, LLMs return text, not data, and are trained to behave like chat bots, not game engines. Initially, I solved this by using a sequence of prompts where each step wraps user content in specific instructions on processing and output-format, spits out some xml, and then gets repeated until the steps are completed. Finally, it'll spit out its response for the outcome, along with a bunch of meta data for affecting user health and the state of the encounter. This, I believe, is also partially how Open AI's newest strawberry model works.\n\nThis process worked great, however it can be improved. It's expensive to use a big model (it was required for the complexity of outputs we were asking of it), and we were using a lot of tokens. However, I realized that we could use the larger model with all of the massive, hyper-engineered prompts to create training data for a smaller model. The smaller model wouldn't need instructions on what to do, nor would it need instructions on output formatting. With a few iterations, I built our training data and fine tuned a smaller LLM model. Despite fine-tuned models costing more, this new process reduced our input token-count by over 50%, saving us 30% on our projected operating costs.",
    "bullets": [
      "Designed and implemented system that integrates text-based LLM models with the game engine. Enables never-before-seen videogame mechanics and storytelling.",
      "Set up multiplayer using websocket connections and Redis 'sessions', balancing lightning fast communication between players with a scalable backend and database.",
      "Set up multiple environments for development, testing, and live, with effortless deployment for each."
    ]
  },
  {
    "id": "cogm",
    "dateString": "Mar 2023 - Jul 2024",
    "title": "Founder of Co-GM",
    "location": "Minneapolis, MN",
    "companyName": "Rhyneer Consulting LLC",
    "imgSrc": "https://d3fcqgp9jd8oav.cloudfront.net/co-gm/assets/screenshots/computer-session.png",
    "description": "I built a powerful wiki tool for storytellers. Check it out at cogm.tech. 1500+ users, 50+ paying subscribers, and still growing. I did everything from UI/UX design to system architecting to marketing to customer service.",
    "stats": [
      { "name": "JavaScript", "level": 90 },
      { "name": "Express", "level": 80 },
      { "name": "Node", "level": 75 },
      { "name": "Azure App Services", "level": 70 },
      { "name": "CSS", "level": 85 },
      { "name": "MongoDB", "level": 80 }
    ],
    "readMoreText": "Co-GM is an online note taking tool that I built specifically to help GMs (the people who run games of Dungeons and Dragons) keep their ideas organized and their head in the game rather than in their screens. It's a niche tool, but since the project's beginnings I've garnered nearly 1,500 users and over 50 paying monthly subscribers. Besides notes, the tool incorporates a large array of other tools critical to any GM's toolbox, and integrates all of them. Notes link together, but you can also link to things that aren't notes to create other effects, like automatically rolling dice or generating random content. You can share libraries of notes with other users, and you can publish your work on a shared workshop to allow other users to find tools they'd find useful for themselves.\n\nTo build this tool, I taught myself almost everything. It's built on a React frontend, it's got a TypeScript Node backend, and all the data is stored in MongoDB. The app is set up with CI/CD via GitHub actions, and deploys automatically to staging environments in Azure App services. From there, I can perform further testing and release to users. In addition to all of the languages and frameworks used, I overcame the following technical challenges:\n\n- I designed and implemented a custom security system from the ground up, creating a robust permissions framework that allows users to selectively share content while maintaining strict control over who can view versus edit their work.\n- I designed and implemented nuanced and complex note-relationship patterns. For example, typing out a date in a note makes the note automatically show up in a fantasy (non-gregorian) calendar.\n- I implemented a rich rich text editor in the browser, and then extended it to enable custom elements and behaviors.\n\nBuilding and growing Co-GM required a lot of additional softer skills. I made the creatives and ran an ad campaign on Reddit with comments turned on, meaning I was regularly interacting directly with my potential consumers. I was Customer Support as well, meaning I was directly helping those consumers troubleshoot their issues (it also made me much more concerned about the quality of logging in prod, the importance of backups, and how to do smooth feature rollouts). And lastly, for a few months of the project, I managed to convince someone else to work on the project with me. I onboarded them, and during that time acted as a mentor, teaching them the work cycle of the project and helping them find easier but still meaningful tasks to work on.",
    "bullets": [
      "Solo-developed a web app. Designed, architected, programmed, and maintained by me.",
      "App includes a custom-built active directory, complex wiki functionalities, a shareable marketplace where users can subscribe to and rate other users' content, and a paid subscription option, among other features.",
      "Ran ad campaign that saw a 1% CTR and 30% landing page conversion rate.",
      "Automated E2E testing and CI/CD."
    ]
  },
  {
    "id": "gamedev",
    "dateString": "Sep 2021 - Sep 2022",
    "title": "Game Developer",
    "location": "Claremont, CA",
    "companyName": "Independent",
    "imgSrc": "/assets/unity.png",
    "stats": [
      { "name": "C#", "level": 85 },
      { "name": "OOP Principles", "level": 97 },
      { "name": "Unity", "level": 80 }
    ],
    "description": "In partnership with another developer, I developed Tell Your Tale, a multiplayer, 3D RPG, from the ground up. Advanced OOP, lots of design patterns, and concurrency/race conditions—it was a glorious mess.",
    "bullets": [
      "Developed a multiplayer, RPG game with over 20,000 lines of C# code, using industry standard tools.",
      "Implemented procedural terrain algorithms, combat systems and physics for a 3D environment, integration with the app store, multiplayer functionality, and custom, internal tools for faster development."
    ]
  },
  {
    "id": "cea",
    "dateString": "Jun 2021 - Sep 2021",
    "title": "AI Engineering Intern",
    "location": "Boulder, CO",
    "companyName": "Clean Energy Asociates",
    "imgSrc": "/assets/cea.png",
    "stats": [
      { "name": "Python", "level": 90 },
      { "name": "ML Libraries", "level": 80 }
    ],
    "description": "Developed machine vision algorithms for processing and flagging images of solar panels. They set me loose, and I wowed them by automating training data collection and then completing the AI model that used it.",
    "bullets": [
      "Identified inefficiency in training data collection methods and independently developed a Python application using classical Python image processing libraries to turn images into usable training data, saving the company 25 hours of work per week (500%+ increase in efficiency). I hate inefficiency.",
      "Implemented convolutional neural networks for image processing using TensorFlow and Keras. Achieved perfect accuracy in drawing bounding boxes around solar panel cells."
    ]
  },
  {
    "id": "carleton",
    "dateString": "Sep 2018 - Sep 2022",
    "title": "Computer Science Student",
    "location": "Northfield, MN",
    "companyName": "Carleton College",
    "imgSrc": "/assets/carleton.png",
    "stats": [
      { "name": "Python", "level": 90 },
      { "name": "ML Libraries", "level": 80 },
      { "name": "C", "level": 60 }
    ],
    "description": "While at Carleton, I focused on AI and machine learning. For my capstone AI project I received distinction for exceptional work among CS graduates.",
    "bullets": [
      "Reddit AI: Built a Reddit bot trained with transformers and a novel 'pass-through' technique to generate comments. College awarded me distinction for exceptional work in major.",
      "AI Stock market analysis: Made tool that uses machine learning to predict stock prices. Found statistically significant results."
    ]
  }
]
